Revit 2026 API

# FlowTransitionCharacteristic Enumeration

---

The flow transition characteristic of the analytical segment.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FlowTransitionCharacteristic
```
```vb
Public Enumeration FlowTransitionCharacteristic
```
```cpp
public enum class FlowTransitionCharacteristic
```
```fsharp
type FlowTransitionCharacteristic
```

| Member name | Value | Description |
| --- | --- | --- |
| Contraction | 2 | The segment profile is contracting along the flow direction. |
| Expansion | 1 | The segment profile is expanding along the flow direction. |
| Undefined | 0 | The flow transition characteristic is undefined. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace